#### Importing necessary libraries

In [19]:
import pandas as pd
from sqlalchemy import create_engine

#### Providing location of db

In [20]:
engine=create_engine('sqlite:///D:\Yash\Learning material\EXL eDART\SQL\Hands--on\\chinook.db')

#### Displaying the table names in our database

In [21]:
table_names=engine.table_names()
print(table_names)

['albums', 'artists', 'customers', 'employees', 'genres', 'invoice_items', 'invoices', 'media_types', 'playlist_track', 'playlists', 'sqlite_sequence', 'sqlite_stat1', 'tracks']

#### Creating connection object

In [22]:
con=engine.connect()

In [23]:
# Very basic SELECT operation
rs=con.execute("SELECT * FROM employees")

#### Storing that table in dataframe df

In [6]:
df=pd.DataFrame(rs.fetchall())

In [24]:
con.close()

In [26]:
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,1,Adams,Andrew,General Manager,NaN,1962-02-18 00:00:00,2002-08-14 00:00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08 00:00:00,2002-05-01 00:00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,1973-08-29 00:00:00,2002-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
3,4,Park,Margaret,Sales Support Agent,2.0,1947-09-19 00:00:00,2003-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
4,5,Johnson,Steve,Sales Support Agent,2.0,1965-03-03 00:00:00,2003-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com

In [8]:
print(df.head())

   0        1         2                    3    4                    5  \
0  1    Adams    Andrew      General Manager  NaN  1962-02-18 00:00:00
1  2  Edwards     Nancy        Sales Manager  1.0  1958-12-08 00:00:00
2  3  Peacock      Jane  Sales Support Agent  2.0  1973-08-29 00:00:00
3  4     Park  Margaret  Sales Support Agent  2.0  1947-09-19 00:00:00
4  5  Johnson     Steve  Sales Support Agent  2.0  1965-03-03 00:00:00

                     6                    7         8   9      10       11  \
0  2002-08-14 00:00:00  11120 Jasper Ave NW  Edmonton  AB  Canada  T5K 2N1
1  2002-05-01 00:00:00         825 8 Ave SW   Calgary  AB  Canada  T2P 2T3
2  2002-04-01 00:00:00        1111 6 Ave SW   Calgary  AB  Canada  T2P 5M5
3  2003-05-03 00:00:00     683 10 Street SW   Calgary  AB  Canada  T2P 5G3
4  2003-10-17 00:00:00         7727B 41 Ave   Calgary  AB  Canada  T3B 1Y7

                  12                 13                        14
0  +1 (780) 428-9482  +1 (780) 428-3457    andrew@chinookcorp.com
1  +1 (403) 262-3443  +1 (403) 262-3322     nancy@chinookcorp.com
2  +1 (403) 262-3443  +1 (403) 262-6712      jane@chinookcorp.com
3  +1 (403) 263-4423  +1 (403) 263-4289  margaret@chinookcorp.com
4   1 (780) 836-9987   1 (780) 836-9543     steve@chinookcorp.com

In [9]:
df.shape

(8, 15)

In [10]:
# Fetching only two columns and 4 records
con=engine.connect()
rs1=con.execute("SELECT LastName, Title FROM employees")
df1=pd.DataFrame(rs1.fetchmany(size=4))
df1.columns=rs1.keys()
print(len(df1))
print(df1.head())

4
  LastName                Title
0    Adams      General Manager
1  Edwards        Sales Manager
2  Peacock  Sales Support Agent
3     Park  Sales Support Agent

In [11]:
# Using WHERE statement
rs2=con.execute("SELECT * FROM employees WHERE EmployeeID>=6")
df2=pd.DataFrame(rs2.fetchall())
df2.columns=rs2.keys()
df2.head()

,EmployeeId,LastName,FirstName,Title,ReportsTo,BirthDate,HireDate,Address,City,State,Country,PostalCode,Phone,Fax,Email
0,6,Mitchell,Michael,IT Manager,1,1973-07-01 00:00:00,2003-10-17 00:00:00,5827 Bowness Road NW,Calgary,AB,Canada,T3B 0C5,+1 (403) 246-9887,+1 (403) 246-9899,michael@chinookcorp.com
1,7,King,Robert,IT Staff,6,1970-05-29 00:00:00,2004-01-02 00:00:00,590 Columbia Boulevard West,Lethbridge,AB,Canada,T1K 5N8,+1 (403) 456-9986,+1 (403) 456-8485,robert@chinookcorp.com
2,8,Callahan,Laura,IT Staff,6,1968-01-09 00:00:00,2004-03-04 00:00:00,923 7 ST NW,Lethbridge,AB,Canada,T1H 1Y8,+1 (403) 467-3351,+1 (403) 467-8772,laura@chinookcorp.com

In [12]:
# Using ORDER by statement
rs3=con.execute("SELECT * FROM employees ORDER BY BirthDate")
df3=pd.DataFrame(rs3.fetchall())
df3.columns= rs3.keys()
print(df3.head())

   EmployeeId  LastName FirstName                Title  ReportsTo  \
0           4      Park  Margaret  Sales Support Agent        2.0
1           2   Edwards     Nancy        Sales Manager        1.0
2           1     Adams    Andrew      General Manager        NaN
3           5   Johnson     Steve  Sales Support Agent        2.0
4           8  Callahan     Laura             IT Staff        6.0

             BirthDate             HireDate              Address        City  \
0  1947-09-19 00:00:00  2003-05-03 00:00:00     683 10 Street SW     Calgary
1  1958-12-08 00:00:00  2002-05-01 00:00:00         825 8 Ave SW     Calgary
2  1962-02-18 00:00:00  2002-08-14 00:00:00  11120 Jasper Ave NW    Edmonton
3  1965-03-03 00:00:00  2003-10-17 00:00:00         7727B 41 Ave     Calgary
4  1968-01-09 00:00:00  2004-03-04 00:00:00          923 7 ST NW  Lethbridge

  State Country PostalCode              Phone                Fax  \
0    AB  Canada    T2P 5G3  +1 (403) 263-4423  +1 (403) 263-4289
1    AB  Canada    T2P 2T3  +1 (403) 262-3443  +1 (403) 262-3322
2    AB  Canada    T5K 2N1  +1 (780) 428-9482  +1 (780) 428-3457
3    AB  Canada    T3B 1Y7   1 (780) 836-9987   1 (780) 836-9543
4    AB  Canada    T1H 1Y8  +1 (403) 467-3351  +1 (403) 467-8772

                      Email
0  margaret@chinookcorp.com
1     nancy@chinookcorp.com
2    andrew@chinookcorp.com
3     steve@chinookcorp.com
4     laura@chinookcorp.com

In [13]:
# Compact way
df4=pd.read_sql_query("SELECT * FROM Albums",engine)
df4.head()

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3

In [14]:
df4=pd.read_sql_query("SELECT * FROM Albums",engine)

In [15]:
# Using Inner Join
rs4=con.execute("SELECT Title, Name FROM Albums INNER JOIN Artists on Albums.ArtistID=Artists.ArtistID")
df4=pd.DataFrame(rs4.fetchall())
df4.columns=rs4.keys()
print(len(df4))
df4.head()

347

                                   Title       Name
0  For Those About To Rock We Salute You      AC/DC
1                      Balls to the Wall     Accept
2                      Restless and Wild     Accept
3                      Let There Be Rock      AC/DC
4                               Big Ones  Aerosmith

In [16]:
# Executing complex query
df5=pd.read_sql_query("SELECT * FROM playlist_track INNER JOIN Tracks on playlist_track.TrackID = Tracks.TrackID WHERE Milliseconds<250000", engine)
df5.head()

,PlaylistId,TrackId,TrackId,Name,AlbumId,MediaTypeId,GenreId,Composer,Milliseconds,Bytes,UnitPrice
0,1,3,3,Fast As a Shark,3,2,1,"F. Baltes, S. Kaufman, U. Dirkscneider & W. Ho...",230619,3990994,0.99
1,5,3,3,Fast As a Shark,3,2,1,"F. Baltes, S. Kaufman, U. Dirkscneider & W. Ho...",230619,3990994,0.99
2,8,3,3,Fast As a Shark,3,2,1,"F. Baltes, S. Kaufman, U. Dirkscneider & W. Ho...",230619,3990994,0.99
3,17,3,3,Fast As a Shark,3,2,1,"F. Baltes, S. Kaufman, U. Dirkscneider & W. Ho...",230619,3990994,0.99
4,1,6,6,Put The Finger On You,1,1,1,"Angus Young, Malcolm Young, Brian Johnson",205662,6713451,0.99

In [17]:
import os
os.getcwd()

'D:\\Yash\\Learning material\\EXL eDART\\SQL\\Hands--on'